liuzhijun23/SuperBlockPro/Driver/APM32E030_StdPeriphDriver/src/apm32e030_i2c.c
}

/*!
 * @brief       Enables the Broadcast call mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableBroadcastCall(I2C_T* i2c)
{
    i2c->CTRL1_B.RBEN = BIT_SET;
}

/*!
 * @brief       Disables the Broadcast call mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableBroadcastCall(I2C_T* i2c)
{
    i2c->CTRL1_B.RBEN = BIT_RESET;
}

/*!
 * @brief       Enables the slave byte control
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableSlaveByteControl(I2C_T* i2c)
{
    i2c->CTRL1_B.SBCEN = BIT_SET;
}

/*!
 * @brief       Disables the slave byte control
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableSlaveByteControl(I2C_T* i2c)
{
    i2c->CTRL1_B.SBCEN = BIT_RESET;
}

/*!
 * @brief       Configures the slave address
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @param       address: set I2C slave uint16_t Address
 *
 * @retval      None
 */
void I2C_SlaveAddress(I2C_T* i2c, uint16_t address)
{
    uint32_t temp = 0;
    temp = i2c->CTRL2;

    temp &= (uint32_t)~((uint32_t)0x000003FF);
    i2c->CTRL2 = temp;

    i2c->ADDR2_B.ADDR2 = address;
}

/*!
 * @brief       Enables I2C 10-bit addressing mode for the master
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_Enable10BitAddressingMode(I2C_T* i2c)
{
    i2c->CTRL2_B.SADDRLEN = BIT_SET;
}

/*!
 * @brief       Disables I2C 10-bit addressing mode for the master
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_Disable10BitAddressingMode(I2C_T* i2c)
{
    i2c->CTRL2_B.SADDRLEN = BIT_RESET;
}

/*!
 * @brief       Enables the I2C automatic end mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableAutoEnd(I2C_T* i2c)
{
    i2c->CTRL2_B.ENDCFG = BIT_SET;
}

/*!
 * @brief       Disables the I2C automatic end mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableAutoEnd(I2C_T* i2c)
{
    i2c->CTRL2_B.ENDCFG = BIT_RESET;
}

/*!
 * @brief       Enables the I2C nbytes reload mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableReload(I2C_T* i2c)
{
    i2c->CTRL2_B.RELOADEN = BIT_SET;
}

/*!
 * @brief       Disables the I2C nbytes reload mode
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableReload(I2C_T* i2c)
{
    i2c->CTRL2_B.RELOADEN = BIT_RESET;
}

/*!
 * @brief       Configures the number of bytes to be transmitted/received
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @param       number:Set uint8_t bytes to read or write
 *
 * @retval      None
 */
void I2C_ConfigNumberOfBytes(I2C_T* i2c, uint8_t number)
{
    i2c->CTRL2_B.NUMBYT = 0xFF;
    i2c->CTRL2_B.NUMBYT  &= (uint8_t) number ;
}

/*!
 * @brief       Configures the type of transfer request for the master
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @param       direction: selects the I2C transfer direction.
 *                         The parameter can be one of following values:
 *                         @arg I2C_DIRECTION_TX:   Transmission direction
 *                         @arg I2C_DIRECTION_RX:   Reception direction
 *
 * @retval      None
 */
void I2C_ConfigMasterRequest(I2C_T* i2c, I2C_DIRECTION_T  direction)
{
    i2c->CTRL2_B.TXDIR  =  direction ;
}

/*!
 * @brief       Enables the generates i2c communication start condition
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableGenerateStart(I2C_T* i2c)
{
    i2c->CTRL2_B.START = BIT_SET;
}

/*!
 * @brief       Disables the generates i2c communication start condition
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableGenerateStart(I2C_T* i2c)
{
    i2c->CTRL2_B.START = BIT_RESET;
}

/*!
 * @brief       Enables the generates i2c communication stop condition
 *
 * @param       i2c:   Select I2C peripheral
 *                      This parameter can be any combination of the following values:
 *                     @arg I2C1
 *                     @arg I2C2
 *
 * @retval      None
 */
void I2C_EnableGenerateStop(I2C_T* i2c)
{
    i2c->CTRL2_B.STOP = BIT_SET;
}

/*!
 * @brief       Disables the generates i2c communication stop condition
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableGenerateStop(I2C_T* i2c)
{
    i2c->CTRL2_B.STOP = BIT_RESET;
}

/*!
 * @brief       Enables I2C 10-bit header only mode with read direction
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_Enable10BitAddressHeader(I2C_T* i2c)
{
    i2c->CTRL2_B.ADDR10 = BIT_SET;
}

/*!
 * @brief       Disables I2C 10-bit header only mode with read direction
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_Disable10BitAddressHeader(I2C_T* i2c)
{
    i2c->CTRL2_B.ADDR10 = BIT_RESET;
}

/*!
 * @brief       Enables I2C communication Acknowledge
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_EnableAcknowledge(I2C_T* i2c)
{
    i2c->CTRL2_B.NACKEN = BIT_RESET;
}

/*!
 * @brief       Disables I2C communication Acknowledge
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      None
 */
void I2C_DisableAcknowledge(I2C_T* i2c)
{
    i2c->CTRL2_B.NACKEN = BIT_SET;
}

/*!
 * @brief       Returns the I2C slave matched address
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      The value is slave matched address
 */
uint8_t I2C_ReadAddressMatched(I2C_T* i2c)
{
    return ((uint8_t)i2c->STS_B.ADDRCMFLG);
}

/*!
 * @brief       Returns the I2C slave received request
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @retval      The value of the received request
 */
uint16_t I2C_ReadTransferDirection(I2C_T* i2c)
{
    uint16_t direction = 0;
    uint32_t temp = 0;

    temp = (uint32_t) i2c->STS_B.TXDIRFLG;

    if (temp == 0)
    {
        direction = (uint16_t)I2C_DIRECTION_TX;
    }
    else
    {
        direction = (uint16_t)(I2C_DIRECTION_RX << 10);
    }

    return direction;
}

/*!
 * @brief       Handles I2Cx communication when starting transfer or during transfer
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2.
 *
 * @param       address:    specifies the slave address to be programmed.
 *
 * @param       number:     specifies the number of bytes to be programmed.
 *                          This parameter must be a value between 0 and 255.
 *
 * @param       reloadend:  the I2C reload end mode
 *                          The parameter can be one of following values:
 *                          @arg I2C_RELOAD_MODE_RELOAD:  Enable Reload mode.
 *                          @arg I2C_RELOAD_MODE_AUTOEND: Enable Automatic end mode.
 *                          @arg I2C_RELOAD_MODE_SOFTEND: Enable Software end mode.
 *
 * @param       generates:  the I2C start/stop mode
 *                          The parameter can be one of following values:
 *                          @arg I2C_GENERATE_NO_STARTSTOP: Don't Generate stop and start condition.
 *                          @arg I2C_GENERATE_START_WRITE:  Generate Restart for write request.
 *                          @arg I2C_GENERATE_STOP:         Generate stop condition
 *                          @arg I2C_GENERATE_START_READ:   Generate Restart for read request.
 *
 * @retval      None
 */
void I2C_HandlingTransfer(I2C_T* i2c, uint16_t address, uint8_t number, I2C_RELOAD_MODE_T reloadend, I2C_GENERATE_T generates)
{
    uint32_t temp = 0;

    /* Get the CTRL2 register value */
    temp = i2c->CTRL2;

